---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.TopLevelBelowBottomLevel
source: html/9fb46ab2-10ee-dbcf-9c49-6015bddcb059.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.TopLevelBelowBottomLevel Property

For curveElem support multiple levels, top level belows curve bottom level.

## Syntax (C#)
```csharp
public static FailureDefinitionId TopLevelBelowBottomLevel { get; }
```